In [1]:
#import the library
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
from datetime import timedelta
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [18]:
#list dataset path and read
contracts = "./contracts.csv"
contracts = pd.read_csv(contracts)
display(contracts.head(),contracts.info())

discount_types = "./discount_types.csv"
discount_types = pd.read_csv(discount_types)
display(discount_types.head(),discount_types.info())

funnel = "./funnel.csv"
funnel = pd.read_csv(funnel)
display(funnel.head(),funnel.info())

google_analytics = "./google_analytics.csv"
google_analytics = pd.read_csv(google_analytics)
display(google_analytics.head(),google_analytics.info())

industries = "./industries.csv"
industries = pd.read_csv(industries)
display(industries.head(),industries.info())

leads = "./leads.csv"
leads = pd.read_csv(leads)
display(leads.head(),leads.info())

session_sources = "./session_sources.csv"
session_sources = pd.read_csv(session_sources)
display(session_sources.head(),session_sources.info())

stages = "./stages.csv"
stages = pd.read_csv(stages)
display(stages.head(),stages.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1754 entries, 0 to 1753
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   contract_id         1754 non-null   int64
 1   leads_id            1754 non-null   int64
 2   date                1754 non-null   object
 3   subscription_type   1754 non-null   object
 4   number_of_employee  1754 non-null   int64
 5   reten_flag          1754 non-null   int64
 6   user_price          1754 non-null   int64
dtypes: int64(5), object(2)
memory usage: 96.0+ KB

,contract_id,leads_id,date,subscription_type,number_of_employee,reten_flag,user_price
0,1194,3338,2022-12-19,Startup,15,0,20000
1,1737,3338,2023-12-19,Startup,15,1,20000
2,268,980,2021-10-07,Startup,275,0,20000
3,441,1579,2022-02-01,Startup,275,0,20000
4,1283,1579,2023-02-01,Startup,275,1,20000

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   discount_type_code  2 non-null      object
 1   discount_type       2 non-null      object
 2   discount_type_desc  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

  discount_type_code          discount_type discount_type_desc
0                 D2  2022_quarter_discount  3 month discounts
1                 D1  2021_quarter_discount  3 month discounts

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16328 entries, 0 to 16327
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   funnel_id  16328 non-null  int64
 1   leads_id   16328 non-null  int64
 2   stage_id   16328 non-null  int64
 3   TimeStamp  16328 non-null  object
 4   reason     1990 non-null   object
dtypes: int64(3), object(2)
memory usage: 637.9+ KB

   funnel_id  leads_id  stage_id                       TimeStamp reason
0          1         1       101  2020-11-25 13:49:44.000000 UTC    NaN
1          2         2       101  2020-11-26 09:04:53.000000 UTC    NaN
2          3         3       101  2020-11-26 09:26:32.000000 UTC    NaN
3          4         4       101  2020-11-26 13:56:31.000000 UTC    NaN
4          5         5       101  2020-11-27 11:07:38.000000 UTC    NaN

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11939 entries, 0 to 11938
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   leads_id        11939 non-null  int64
 1   ga_id           11939 non-null  int64
 2   Page_Name       11939 non-null  object
 3   Page_timestamp  11939 non-null  object
dtypes: int64(2), object(2)
memory usage: 373.2+ KB

   leads_id  ga_id Page_Name                  Page_timestamp
0         1      1     /home  2020-11-25 13:47:09.000000 UTC
1         7     24     /home  2020-11-30 12:12:30.000000 UTC
2         8     27     /home  2020-11-30 16:08:34.000000 UTC
3        13     47     /home  2020-12-01 11:22:49.000000 UTC
4        16     53     /home  2020-12-02 12:56:54.000000 UTC

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   industry_code  6 non-null      int64
 1   industry       6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

   industry_code    industry
0              3     Finance
1              5      Retail
2              1   Education
3              6  Technology
4              2         F&B

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3397 entries, 0 to 3396
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   leads_id             3397 non-null   int64
 1   session_source_code  3397 non-null   int64
 2   industry_code        3397 non-null   int64
 3   leads_registered     3397 non-null   object
 4   number_of_employee   3397 non-null   int64
dtypes: int64(4), object(1)
memory usage: 132.8+ KB

,leads_id,session_source_code,industry_code,leads_registered,number_of_employee
0,244,1,1,2021-02-03 14:36:48.000000 UTC,5
1,290,4,1,2021-02-23 14:27:36.000000 UTC,5
2,425,1,1,2021-03-30 15:10:12.000000 UTC,5
3,437,4,1,2021-04-01 15:39:02.000000 UTC,5
4,462,4,1,2021-04-06 10:44:11.000000 UTC,5

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   session_source_code  5 non-null      int64
 1   session_source       5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   session_source_code  session_source
0                    1             CPC
1                    4  Organic Social
2                    3  Organic Search
3                    2          Direct
4                    5        Refferal

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   stage_id  8 non-null      int64
 1   stage     8 non-null      object
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

   stage_id                          stage
0       103  initial_communication_success
1       105             discussion_success
2       106                     offer_sent
3       107             quotation_recieved
4       108                       deal_won

None